'''
撰寫一個函式完成以下要求:
1. 函式名稱: compute_total
2. 功能: 計算音樂會團體票總金額 (一次可購買某座位區的多張票)
3. 傳入參數: 
   (1) 座位區域 (參數自訂, 接收一個字串)
   (2) 入場者者年齡 (參數自訂, 接收不定個數的整數)
4. 團體票總金額計算方式:
   (1) 每人入場金額 (年齡>=60可買敬老票)
       若座位區域為 'A', 每人入場金額 2,500元, 敬老票 1,800元
       若座位區域為 'B', 每人入場金額 2,000元, 敬老票 1,350元
       若座位區域為 'C', 每人入場金額 1,500元, 敬老票 800元
       其他, 每人入場金額 1,000元, 敬老票 500元   
   (2) 總金額
       總金額 = 票券上所有人的入場金額加總
   (3) 回傳「總金額」    
'''
#(寫下你的函式)
def compute_total(area,*age):
    total = 0
    for i in range(len(age)):
        if age[i] >= 60:
            if area == "A":
                total += 1800
            elif area == "B":
                total += 1350
            elif area == "C":
                total += 800
            else:
                total += 500
        else:
            if area == "A":
                total += 2500
            elif area == "B":
                total += 2000
            elif area == "C":
                total += 1500
            else:
                total += 1000
    return total




#===============================
#主程式, 已完成, 不必修改
#===============================
print(f'{compute_total("A", 60, 55):,}元')      #買2張A區的票, 1人60歲, 1人55歲
print(f'{compute_total("A", 32, 30, 8):,}元')   #買3張A區的票, 年齡分別是32, 30, 8歲

print(f'{compute_total("B", 66, 65):,}元') 
print(f'{compute_total("B", 40, 35):,}元')  

print(f'{compute_total("C", 25, 23):,}元') 
print(f'{compute_total("C", 65, 55, 40, 38):,}元')

print(f'{compute_total("D", 66, 65):,}元') 
print(f'{compute_total("D", 43, 41, 18, 16):,}元')
#===============================

#參考解答
'''
4,300元
7,500元
2,700元
4,000元
3,000元
5,300元
1,000元
4,000元
'''