'''
二. 計算電費
    假設某電力公司計算「電費」以「用電類型」及「使用度數」為依據，說明如下：

    1. 輸入:
       多組「用電類型」及「使用度數」(存在 list 中的資料)
       
    2. 處理:
       (1) 用電類型為「家庭用電」的收費標準:        
           ...................................
             使用度數           每度收費（元）   
           ...................................
             1000度(含)以上       6.83
             500-999度            6.21          
             不足500度            4.12       
           ...................................

       (2) 用電類型為「工廠用電」的收費標準:        
           ...................................
             使用度數           每度收費（元）   
           ...................................
             1000度(含)以上       7.21                
             不足1000度           6.33       
           ...................................
                
       (3) 例如:
          「家庭用電」750度, 其總電費為:
           6.21 * 750  
           = 4657.5
           
           「工廠用電」750度, 其總電費為:
           6.33 * 750  
           = 4747.5
           
    3. 輸出:
       總電費 (四捨五入至整數, 加入千分位符號)

    4. 測試資料:
       data = [('家庭用電',1000), ('家庭用電',500), ('家庭用電',400), ('家庭用電',850), ('工廠用電',1000), ('工廠用電',1200), ('工廠用電',420), ('工廠用電',850)]

'''
data = [('家庭用電',1000), ('家庭用電',500), ('家庭用電',400), ('家庭用電',850), ('工廠用電',1000), ('工廠用電',1200), ('工廠用電',420), ('工廠用電',850)]

for types,elc in data:
    if types == '家庭用電':
        if elc >= 1000:
            price = 6.83 * elc
        elif 1000 > elc >= 500:
            price = 6.21 * elc
        else:
            price = 4.12 * elc
    elif types == '工廠用電':
        if elc >= 1000:
            price = 7.21 * elc
        else:
            price = 6.33 * elc
    print(f'{round(price,0):,.0f}')
