'''
三. 計算電費
    假設某電力公司計算「電費」以「地區別」、「使用度數」、「溢收退費」及「用電補助」為依據，說明如下：

    1. 輸入:
       多組「地區別」、「使用度數」、「溢收退費」及「用電補助」(存在 list 中的資料)
       
    2. 處理:
       (1) 地區別為A, C, D, F其中之一, 收費標準:        
           ...................................
            使用度數           每度收費（元）   
           ...................................
            1000度(含)以上       6.83
            不足1000度           4.12       
           ...................................                   

       (2) 地區別為B, H其中之一, 收費標準: 
           每度電5.98元.                   
                
       (3) 地區別不屬於以上任何之一, 收費標準:
           每度電5.17元.           
           
       (4) 為了維護電纜, 用電每達50度, 總電費加收3元, 不足50度的剩餘部分不加收.
           例如: 用電230度(達到4次50度), 總電費加收: 3元*4 = 12元
       
       (5) 如果有「溢收退費」, 總電費折扣100元.
           如果有「用電補助」, 總電費折扣250元.
           以上兩者可以同時使用, 但如果總電費經過折扣之後變成負數, 則總電費收0元.            
                      
    3. 輸出:
       總電費 (四捨五入至整數, 加入千分位符號)

    4. 測試資料:
       data = [('A',1000,'無','無'), ('C',500,'無','有'), ('D',400,'有','無'), ('F',1850,'有','有'), ('B',300,'無','無'), ('H',1200,'無','有'), ('K',1220,'有','無'), ('M',55,'有','有')]  
'''
data = [('A',1000,'無','無'), ('C',500,'無','有'), ('D',400,'有','無'), ('F',1850,'有','有'), ('B',300,'無','無'), ('H',1200,'無','有'), ('K',1220,'有','無'), ('M',55,'有','有')]

for area,elc,overflow,discount in data:
    price = 0
    if area in ('A','C','D','F'):
        if elc >= 1000:
            price = 6.83 * elc
        else:
            price = 4.12 * elc
    elif area in ('B','H'):
        price = 5.98 * elc
    else:
        price = 5.17 * elc
    if elc // 50 > 0:
        price = price + elc // 50 * 3
    if overflow == '有':
        price -= 100
    if discount == '有':
        price -= 250
    if price < 0:
        price = 0
    print(f'{round(price,0):,.0f}')