'''
一. 計算電費
    假設某電力公司計算「電費」以「使用度數」為依據，說明如下：

    1. 輸入:
       多組「使用度數」(存在 list 中的資料)
       
    2. 處理:
       (1) 電費收費標準:
           ...................................
             使用度數            每度收費（元）   
           ...................................
             1000度(含)以上        6.71 
             700-999度             6.16  
             500-699度             5.32        
             300-499度             4.39  
             不足300度             2.11       
           ...................................
        
       (2) 例如:用電750度, 其總電費為:
           6.16 * 750  
           = 4620
           
    3. 輸出:
       總電費 (四捨五入至整數, 加入千分位符號)

    4. 測試資料:
       data = [1000, 700, 300, 550, 150, 755, 531, 1299]  
'''

data = [1000, 700, 300, 550, 150, 755, 531, 1299]

for elc in data:
    if elc >= 1000:
        price = 6.71 * elc
    elif 1000 > elc >= 700:
        price = 6.16 * elc
    elif 700 > elc >= 500:
        price = 5.32 * elc
    elif 500 > elc >= 300:
        price = 4.39 * elc
    else:
        price = 2.11 * elc

    print(f'{round(price,0):,.0f}')
