'''
撰寫一個函式完成以下要求:

1. 函式名稱: compute_total
2. 功能: 計算飲料總金額        
3. 傳入參數: 
   (1) 指定飲料品項及購買杯數  (不定個數的keyword參數, key是飲料品項, value是購買杯數)   
4. 總金額計算方式:
   (1) 飲料費用
       (1-1)品項
         「飲料品項」的前2碼代表品項, 共有「紅茶」、「奶茶」、「珍奶」、「咖啡」、「拿鐵」等5種, 價格分別如下:
           紅茶:25元
           奶茶:35元
           珍奶:55元
           咖啡:50元
           拿鐵:60元
           
       (1-2)容量
         「飲料品項」的最後1碼代表容量, 共有「S」(小杯)、「M」(中杯)、「L」(大杯)、「X」(特大杯)等4種容量
           每一杯的容量要多付:
            S: 多付0元
            M: 多付10元
            L: 多付15元
            X: 多付25元  
       
       (1-3)飲料費用
          飲料費用 = (品項金額+容量金額) * 購買杯數
          
          例如:
            買了4杯「紅茶S」, 飲料費用 = 25元 * 4 
            買了4杯「紅茶M」, 飲料費用 = (25元+10元) * 4  
            買了4杯「紅茶L」, 飲料費用 = (25元+15元) * 4  
            買了4杯「紅茶X」, 飲料費用 = (25元+25元) * 4  
       
   (2) 外送費用
       若飲料費用達200元, 免收外送費用; 否則外送費用80元
       
   (3) 總金額 = 飲料費用 + 外送費用
       
   (4) 回傳「總金額」     
'''
#(寫下你的函式)
def compute_total(**drinks):
    items = {"紅茶":25,"奶茶":35,"珍奶":55,"咖啡":50,"拿鐵":60}
    size = {"S":0,"M":10,"L":15,"X":25}
    total = 0
    for i in drinks:
        free = 0
        if i[:2] in items:
            free += items[i[:2]]
        if i[-1] in size:
            free += size[i[-1]]
        total += drinks[i] * free
    if total < 200:
        total += 80
    return total




#============================
#主程式, 已完成, 不必修改
#============================
print(f'{compute_total(紅茶S=4):,}元') 
print(f'{compute_total(珍奶M=4):,}元') 
print(f'{compute_total(咖啡S=1, 咖啡L=1):,}元') 
print(f'{compute_total(咖啡X=2, 拿鐵L=1):,}元') 
print(f'{compute_total(奶茶L=4, 珍奶X=3, 咖啡X=4, 拿鐵X=5):,}元') 
print(f'{compute_total(紅茶S=3, 奶茶L=2):,}元')
print(f'{compute_total(紅茶L=1, 奶茶X=1, 咖啡L=1, 拿鐵X=1):,}元')
print(f'{compute_total(珍奶X=5, 奶茶L=4, 咖啡X=6, 拿鐵L=3):,}元')
#===============================

'''
參考解答:
180元
260元
195元
225元
1,165元
255元
250元
1,275元
'''